<a href="https://colab.research.google.com/github/dwwatson1/coronavirus_pandemic_playbook/blob/main/script/no_covid_states.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from IPython.core.debugger import set_trace

In [ ]:
import pandas as pd
import numpy as np
import os
import random
import matplotlib.pyplot as plt
import pickle
import time

In [ ]:
!pip install faker

Requirement already satisfied: faker in /usr/local/lib/python3.7/dist-packages (8.10.3)
Requirement already satisfied: python-dateutil>=2.4 in /usr/local/lib/python3.7/dist-packages (from faker) (2.8.1)
Requirement already satisfied: text-unidecode==1.3 in /usr/local/lib/python3.7/dist-packages (from faker) (1.3)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.4->faker) (1.15.0)

In [ ]:
from faker import Faker

fake=Faker()

Northeast

In [ ]:
# New York
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "NY",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.21, 0.42, 0.20, 0.17]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.48, 0.52]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.6320, 0.1585, 0.0864, 0.0038, 0.0004, 0.1189)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ny_df = pd.DataFrame(faker_categorical(num=18235043, seed=0))
ny_df.head(5)

  res_state age_group sex race
0        NY         1   1    0
1        NY         1   0    1
2        NY         1   1    5
3        NY         1   1    0
4        NY         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ny_df.insert(4, "region", "0")

# Population density
ny_df.insert(5, "pop_density", "282")

# Median income
ny_df.insert(6, "median_income", "71855")

# Airport Per Square Mile
ny_df.insert(7, "airport_area", "0.02")

# State Policy Prevention Mandate Score
ny_df.insert(8, "policy_prevention", "31")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ny_df.insert(9, "has_covid", "1")

In [ ]:
ny_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        NY         1   1  ...         0.02                31         1
1        NY         1   0  ...         0.02                31         1
2        NY         1   1  ...         0.02                31         1
3        NY         1   1  ...         0.02                31         1
4        NY         1   1  ...         0.02                31         1

[5 rows x 10 columns]

In [ ]:
ny_df.to_csv('ny_no_covid.csv', index=False)

In [ ]:
# Connecticut
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "CT",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.21, 0.40, 0.21, 0.18]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7461, 0.1113, 0.0467, 0.0025, 0.0004, 0.0930)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ct_df = pd.DataFrame(faker_categorical(num=3394611, seed=0))
ct_df.head(5)

  res_state age_group sex race
0        CT         1   1    0
1        CT         1   0    0
2        CT         1   1    5
3        CT         1   1    0
4        CT         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ct_df.insert(4, "region", "0")

# Population density
ct_df.insert(5, "pop_density", "736")

# Median income
ct_df.insert(6, "median_income", "87291")

# Airport Per Square Mile
ct_df.insert(7, "airport_area", "0.02")

# State Policy Prevention Mandate Score
ct_df.insert(8, "policy_prevention", "32")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ct_df.insert(9, "has_covid", "1")

In [ ]:
ct_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        CT         1   1  ...         0.02                32         1
1        CT         1   0  ...         0.02                32         1
2        CT         1   1  ...         0.02                32         1
3        CT         1   1  ...         0.02                32         1
4        CT         1   1  ...         0.02                32         1

[5 rows x 10 columns]

In [ ]:
ct_df.to_csv('ct_no_covid.csv', index=False)

In [ ]:
# Pennsylvania
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "PA",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.20, 0.40, 0.21, 0.19]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7963, 0.1136, 0.0354, 0.0021, 0.0004, 0.0522)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
pa_df = pd.DataFrame(faker_categorical(num=12151943, seed=0))
pa_df.head(5)

  res_state age_group sex race
0        PA         1   1    0
1        PA         1   0    0
2        PA         1   1    5
3        PA         1   1    0
4        PA         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
pa_df.insert(4, "region", "0")

# Population density
pa_df.insert(5, "pop_density", "286")

# Median income
pa_df.insert(6, "median_income", "70582")

# Airport Per Square Mile
pa_df.insert(7, "airport_area", "0.02")

# State Policy Prevention Mandate Score
pa_df.insert(8, "policy_prevention", "39")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
pa_df.insert(9, "has_covid", "1")

In [ ]:
pa_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        PA         1   1  ...         0.02                39         1
1        PA         1   0  ...         0.02                39         1
2        PA         1   1  ...         0.02                39         1
3        PA         1   1  ...         0.02                39         1
4        PA         1   1  ...         0.02                39         1

[5 rows x 10 columns]

In [ ]:
pa_df.to_csv('pa_no_covid.csv', index=False)

Southeast

In [ ]:
# Tennessee
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "TN",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.23, 0.41, 0.19, 0.17]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.48, 0.52]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7721, 0.1671, 0.0184, 0.0030, 0.0005, 0.0389)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
tn_df = pd.DataFrame(faker_categorical(num=6261724, seed=0))
tn_df.head(5)

  res_state age_group sex race
0        TN         1   1    0
1        TN         1   0    0
2        TN         1   1    5
3        TN         1   1    0
4        TN         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
tn_df.insert(4, "region", "1")

# Population density
tn_df.insert(5, "pop_density", "166")

# Median income
tn_df.insert(6, "median_income", "56627")

# Airport Per Square Mile
tn_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
tn_df.insert(8, "policy_prevention", "81")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
tn_df.insert(9, "has_covid", "1")

In [ ]:
tn_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        TN         1   1  ...         0.01                81         1
1        TN         1   0  ...         0.01                81         1
2        TN         1   1  ...         0.01                81         1
3        TN         1   1  ...         0.01                81         1
4        TN         1   1  ...         0.01                81         1

[5 rows x 10 columns]

In [ ]:
tn_df.to_csv('tn_no_covid.csv', index=False)

In [ ]:
# Florida
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "FL",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.20, 0.39, 0.20, 0.21]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7454, 0.1602, 0.0279, 0.0028, 0.0008, 0.0629)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
fl_df_part1 = pd.DataFrame(faker_categorical(num=10317928, seed=0))
fl_df_part1.head(5)

  res_state age_group sex race
0        FL         1   1    0
1        FL         1   0    0
2        FL         1   1    5
3        FL         1   1    0
4        FL         1   1    0

In [ ]:
fl_df_part2 = pd.DataFrame(faker_categorical(num=10317927, seed=0))
fl_df_part2.head(5)

  res_state age_group sex race
0        FL         1   1    0
1        FL         1   0    0
2        FL         1   1    5
3        FL         1   1    0
4        FL         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
fl_df_part1.insert(4, "region", "1")

# Population density
fl_df_part1.insert(5, "pop_density", "401")

# Median income
fl_df_part1.insert(6, "median_income", "58368")

# Airport Per Square Mile
fl_df_part1.insert(7, "airport_area", "0.03")

# State Policy Prevention Mandate Score
fl_df_part1.insert(8, "policy_prevention", "91")

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
fl_df_part2.insert(4, "region", "1")

# Population density
fl_df_part2.insert(5, "pop_density", "401")

# Median income
fl_df_part2.insert(6, "median_income", "58368")

# Airport Per Square Mile
fl_df_part2.insert(7, "airport_area", "0.03")

# State Policy Prevention Mandate Score
fl_df_part2.insert(8, "policy_prevention", "91")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
fl_df_part1.insert(9, "has_covid", "1")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
fl_df_part2.insert(9, "has_covid", "1")

In [ ]:
fl_df_part1.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        FL         1   1  ...         0.03                91         1
1        FL         1   0  ...         0.03                91         1
2        FL         1   1  ...         0.03                91         1
3        FL         1   1  ...         0.03                91         1
4        FL         1   1  ...         0.03                91         1

[5 rows x 10 columns]

In [ ]:
fl_df_part2.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        FL         1   1  ...         0.03                91         1
1        FL         1   0  ...         0.03                91         1
2        FL         1   1  ...         0.03                91         1
3        FL         1   1  ...         0.03                91         1
4        FL         1   1  ...         0.03                91         1

[5 rows x 10 columns]

In [ ]:
fl_df_part1.to_csv('fl_no_covid_part1.csv', index=False)

In [ ]:
fl_df_part2.to_csv('fl_no_covid_part2.csv', index=False)

In [ ]:
# Georgia
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "GA",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.24, 0.43, 0.19, 0.14]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.48, 0.52]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.5774, 0.3194, 0.0414, 0.0040, 0.0007, 0.0571)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ga_df = pd.DataFrame(faker_categorical(num=10141507, seed=0))
ga_df.head(5)

  res_state age_group sex race
0        GA         1   1    1
1        GA         1   0    1
2        GA         1   1    5
3        GA         1   1    0
4        GA         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ga_df.insert(4, "region", "1")

# Population density
ga_df.insert(5, "pop_density", "185")

# Median income
ga_df.insert(6, "median_income", "56628")

# Airport Per Square Mile
ga_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
ga_df.insert(8, "policy_prevention", "68")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ga_df.insert(9, "has_covid", "1")

In [ ]:
ga_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        GA         1   1  ...         0.01                68         1
1        GA         1   0  ...         0.01                68         1
2        GA         1   1  ...         0.01                68         1
3        GA         1   1  ...         0.01                68         1
4        GA         1   1  ...         0.01                68         1

[5 rows x 10 columns]

In [ ]:
ga_df.to_csv('ga_no_covid.csv', index=False)

Midwest

In [ ]:
# Ohio
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "OH",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.23, 0.40, 0.20, 0.17]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.8087, 0.1255, 0.0235, 0.0020, 0.0005, 0.0398)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
oh_df = pd.DataFrame(faker_categorical(num=11005799, seed=0))
oh_df.head(5)

  res_state age_group sex race
0        OH         1   1    0
1        OH         1   0    0
2        OH         1   1    5
3        OH         1   1    0
4        OH         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
oh_df.insert(4, "region", "2")

# Population density
oh_df.insert(5, "pop_density", "286")

# Median income
oh_df.insert(6, "median_income", "64663")

# Airport Per Square Mile
oh_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
oh_df.insert(8, "policy_prevention", "47")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
oh_df.insert(9, "has_covid", "1")

In [ ]:
oh_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        OH         1   1  ...         0.01                47         1
1        OH         1   0  ...         0.01                47         1
2        OH         1   1  ...         0.01                47         1
3        OH         1   1  ...         0.01                47         1
4        OH         1   1  ...         0.01                47         1

[5 rows x 10 columns]

In [ ]:
oh_df.to_csv('oh_no_covid.csv', index=False)

In [ ]:
# Wisconsin
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "WI",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.23, 0.39, 0.20, 0.18]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.8524, 0.0644, 0.0288, 0.0094, 0.0007, 0.0443)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
wi_df = pd.DataFrame(faker_categorical(num=5401356, seed=0))
wi_df.head(5)

  res_state age_group sex race
0        WI         1   1    0
1        WI         1   0    0
2        WI         1   1    5
3        WI         1   1    0
4        WI         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
wi_df.insert(4, "region", "2")

# Population density
wi_df.insert(5, "pop_density", "242")

# Median income
wi_df.insert(6, "median_income", "67355")

# Airport Per Square Mile
wi_df.insert(7, "airport_area", "0.03")

# State Policy Prevention Mandate Score
wi_df.insert(8, "policy_prevention", "79")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
wi_df.insert(9, "has_covid", "1")

In [ ]:
wi_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        WI         1   1  ...         0.03                79         1
1        WI         1   0  ...         0.03                79         1
2        WI         1   1  ...         0.03                79         1
3        WI         1   1  ...         0.03                79         1
4        WI         1   1  ...         0.03                79         1

[5 rows x 10 columns]

In [ ]:
wi_df.to_csv('wi_no_covid.csv', index=False)

In [ ]:
# Kansas
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "KS",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.25, 0.40, 0.18, 0.17]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.8361, 0.0578, 0.0299, 0.0082, 0.0008, 0.0672)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ks_df = pd.DataFrame(faker_categorical(num=2688359, seed=0))
ks_df.head(5)

  res_state age_group sex race
0        KS         1   1    0
1        KS         1   0    0
2        KS         1   1    5
3        KS         1   1    0
4        KS         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ks_df.insert(4, "region", "2")

# Population density
ks_df.insert(5, "pop_density", "36")

# Median income
ks_df.insert(6, "median_income", "73151")

# Airport Per Square Mile
ks_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
ks_df.insert(8, "policy_prevention", "68")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ks_df.insert(9, "has_covid", "1")

In [ ]:
ks_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        KS         1   1  ...         0.01                68         1
1        KS         1   0  ...         0.01                68         1
2        KS         1   1  ...         0.01                68         1
3        KS         1   1  ...         0.01                68         1
4        KS         1   1  ...         0.01                68         1

[5 rows x 10 columns]

In [ ]:
ks_df.to_csv('ks_no_covid.csv', index=False)

Southwest

In [ ]:
# New Mexico
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "NM",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.23, 0.40, 0.19, 0.18]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7392, 0.0231, 0.0174, 0.0951, 0.0004, 0.1248)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
nm_df = pd.DataFrame(faker_categorical(num=1961903, seed=0))
nm_df.head(5)

  res_state age_group sex race
0        NM         1   1    0
1        NM         1   0    0
2        NM         1   1    5
3        NM         1   1    0
4        NM         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
nm_df.insert(4, "region", "3")

# Population density
nm_df.insert(5, "pop_density", "44")

# Median income
nm_df.insert(6, "median_income", "53113")

# Airport Per Square Mile
nm_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
nm_df.insert(8, "policy_prevention", "41")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
nm_df.insert(9, "has_covid", "1")

In [ ]:
nm_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        NM         1   1  ...         0.01                41         1
1        NM         1   0  ...         0.01                41         1
2        NM         1   1  ...         0.01                41         1
3        NM         1   1  ...         0.01                41         1
4        NM         1   1  ...         0.01                41         1

[5 rows x 10 columns]

In [ ]:
nm_df.to_csv('nm_no_covid.csv', index=False)

In [ ]:
# Oklahoma
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "OK",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.25, 0.41, 0.18, 0.16]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.49, 0.51]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7242, 0.0726, 0.0227, 0.0801, 0.0013, 0.0991)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ok_df = pd.DataFrame(faker_categorical(num=3656708, seed=0))
ok_df.head(5)

  res_state age_group sex race
0        OK         1   1    0
1        OK         1   0    0
2        OK         1   1    5
3        OK         1   1    0
4        OK         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ok_df.insert(4, "region", "3")

# Population density
ok_df.insert(5, "pop_density", "58")

# Median income
ok_df.insert(6, "median_income", "59397")

# Airport Per Square Mile
ok_df.insert(7, "airport_area", "0.00")

# State Policy Prevention Mandate Score
ok_df.insert(8, "policy_prevention", "86")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ok_df.insert(9, "has_covid", "1")

In [ ]:
ok_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        OK         1   1  ...         0.00                86         1
1        OK         1   0  ...         0.00                86         1
2        OK         1   1  ...         0.00                86         1
3        OK         1   1  ...         0.00                86         1
4        OK         1   1  ...         0.00                86         1

[5 rows x 10 columns]

In [ ]:
ok_df.to_csv('ok_no_covid.csv', index=False)

In [ ]:
# Arizona
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "AZ",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.24, 0.40, 0.18, 0.18]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.50, 0.50]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.7834, 0.0472, 0.0332, 0.0456, 0.0020, 0.0886)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
az_df = pd.DataFrame(faker_categorical(num=6704895, seed=0))
az_df.head(5)

  res_state age_group sex race
0        AZ         1   1    0
1        AZ         1   0    0
2        AZ         1   1    5
3        AZ         1   1    0
4        AZ         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
az_df.insert(4, "region", "3")

# Population density
az_df.insert(5, "pop_density", "140")

# Median income
az_df.insert(6, "median_income", "70674")

# Airport Per Square Mile
az_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
az_df.insert(8, "policy_prevention", "81")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
az_df.insert(9, "has_covid", "1")

In [ ]:
az_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        AZ         1   1  ...         0.01                81         1
1        AZ         1   0  ...         0.01                81         1
2        AZ         1   1  ...         0.01                81         1
3        AZ         1   1  ...         0.01                81         1
4        AZ         1   1  ...         0.01                81         1

[5 rows x 10 columns]

In [ ]:
az_df.to_csv('az_no_covid.csv', index=False)

West

In [ ]:
# California
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "CA",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.23, 0.44, 0.18, 0.15]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.50, 0.50]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.5944, 0.0578, 0.1484, 0.0081, 0.0039, 0.1874)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ca_df_part1 = pd.DataFrame(faker_categorical(num=18516743, seed=0))
ca_df_part1.head(5)

  res_state age_group sex race
0        CA         1   1    1
1        CA         1   0    1
2        CA         1   1    5
3        CA         1   1    0
4        CA         1   1    0

In [ ]:
ca_df_part2 = pd.DataFrame(faker_categorical(num=18516742, seed=0))
ca_df_part2.head(5)

  res_state age_group sex race
0        CA         1   1    1
1        CA         1   0    1
2        CA         1   1    5
3        CA         1   1    0
4        CA         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ca_df_part1.insert(4, "region", "4")

# Population density
ca_df_part1.insert(5, "pop_density", "254")

# Median income
ca_df_part1.insert(6, "median_income", "78105")

# Airport Per Square Mile
ca_df_part1.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
ca_df_part1.insert(8, "policy_prevention", "32")

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ca_df_part2.insert(4, "region", "4")

# Population density
ca_df_part2.insert(5, "pop_density", "254")

# Median income
ca_df_part2.insert(6, "median_income", "78105")

# Airport Per Square Mile
ca_df_part2.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
ca_df_part2.insert(8, "policy_prevention", "32")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ca_df_part1.insert(9, "has_covid", "1")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ca_df_part2.insert(9, "has_covid", "1")

In [ ]:
ca_df_part1.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        CA         1   1  ...         0.01                32         1
1        CA         1   0  ...         0.01                32         1
2        CA         1   1  ...         0.01                32         1
3        CA         1   1  ...         0.01                32         1
4        CA         1   1  ...         0.01                32         1

[5 rows x 10 columns]

In [ ]:
ca_df_part2.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        CA         1   1  ...         0.01                32         1
1        CA         1   0  ...         0.01                32         1
2        CA         1   1  ...         0.01                32         1
3        CA         1   1  ...         0.01                32         1
4        CA         1   1  ...         0.01                32         1

[5 rows x 10 columns]

In [ ]:
ca_df_part1.to_csv('ca_no_covid_part1.csv', index=False)

In [ ]:
ca_df_part2.to_csv('ca_no_covid_part2.csv', index=False)

In [ ]:
# Idaho
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "ID",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.27, 0.39, 0.18, 0.16]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.50, 0.50]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.8936, 0.0071, 0.0145, 0.0128, 0.0014, 0.0706)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
id_df = pd.DataFrame(faker_categorical(num=1650851, seed=0))
id_df.head(5)

  res_state age_group sex race
0        ID         1   1    0
1        ID         1   0    0
2        ID         1   1    5
3        ID         1   1    0
4        ID         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
id_df.insert(4, "region", "4")

# Population density
id_df.insert(5, "pop_density", "32")

# Median income
id_df.insert(6, "median_income", "65988")

# Airport Per Square Mile
id_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
id_df.insert(8, "policy_prevention", "83")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
id_df.insert(9, "has_covid", "1")

In [ ]:
id_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        ID         1   1  ...         0.01                83         1
1        ID         1   0  ...         0.01                83         1
2        ID         1   1  ...         0.01                83         1
3        ID         1   1  ...         0.01                83         1
4        ID         1   1  ...         0.01                83         1

[5 rows x 10 columns]

In [ ]:
id_df.to_csv('id_no_covid.csv', index=False)

In [ ]:
# Utah
def faker_categorical(num=1, seed=None):
  np.random.seed(seed)
  fake.seed_instance(seed)

  output = [
    {
        "res_state": "UT",
        # age_group: 0: 0-17 years, 1: 18-49 years, 2: 50-64 years, 3: 65+ years
        "age_group": np.random.choice(["0", "1", "2", "3"], p=[0.30, 0.44, 0.14, 0.12]),
        # sex: 0-Male, 1-Female
        "sex": np.random.choice(["0", "1"], p=[0.50, 0.50]),
        # race: 0-White, 1-Black, 2-Asian, 3-American Indian/Alaska Native, 4-Native Hawaiian/Other Pacific Islander, 5-Multiple/Other
        "race": np.random.choice(["0", "1", "2", "3", "4", "5"], p=(0.8732, 0.0115, 0.0239, 0.0110, 0.0096, 0.0708)),
    }
    for x in range(num)
  ]
  return output

In [ ]:
ut_df = pd.DataFrame(faker_categorical(num=2915467, seed=0))
ut_df.head(5)

  res_state age_group sex race
0        UT         1   1    0
1        UT         1   0    0
2        UT         1   1    5
3        UT         1   1    0
4        UT         1   1    0

In [ ]:
# Region: 0-Northeast, 1-Southeast, 2-Midwest, 3-Southwest, 4-West
ut_df.insert(4, "region", "4")

# Population density
ut_df.insert(5, "pop_density", "39")

# Median income
ut_df.insert(6, "median_income", "84523")

# Airport Per Square Mile
ut_df.insert(7, "airport_area", "0.01")

# State Policy Prevention Mandate Score
ut_df.insert(8, "policy_prevention", "80")

In [ ]:
# Add column to identify all persons without COVID
# has_covid: O-Yes, 1-No
ut_df.insert(9, "has_covid", "1")

In [ ]:
ut_df.head(5)

  res_state age_group sex  ... airport_area policy_prevention has_covid
0        UT         1   1  ...         0.01                80         1
1        UT         1   0  ...         0.01                80         1
2        UT         1   1  ...         0.01                80         1
3        UT         1   1  ...         0.01                80         1
4        UT         1   1  ...         0.01                80         1

[5 rows x 10 columns]

In [ ]:
ut_df.to_csv('ut_no_covid.csv', index=False)